app/controllers/api/v1/buys_controller.rb

  def index
    render json: Buy.all
---
SELECT "buys".* FROM "buys"