app/controllers/api/v1/contacts_controller.rb

  def index
    render json: Contact.all
---
SELECT "contacts".* FROM "contacts"

  def create
    contact = Contact.new(contact_params)
    contact.save
---
INSERT INTO "contacts" ("first_name", "last_name", "email", "contact_number", "message") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "fasdf"], ["last_name", "asdfa"], ["email", "asdf"], ["contact_number", "sadfa"], ["message", "asdf"]]