app/controllers/api/v1/contributors_controller.rb

  def index
    render json: Contributor.all
---
SELECT "contributors".* FROM "contributors"