app/controllers/api/v1/news_controller.rb

SELECT "news".* FROM "news" ORDER BY "news"."created_at" DESC
---
  def index
    render json: New.all