app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    render json: Product.all