app/controllers/api/v1/roots_controller.rb

  def index
    render json: New.order('created_at DESC')
    render json: Event.order(event_date: DESC)
    render json: Product.all
    render json: Buy.order(:business_name)
    render json: Contributor.all
---
SELECT "news".* FROM "news" ORDER BY created_at DESC
SELECT "products".* FROM "products"
SELECT "contributors".* FROM "contributors"